CH404/nrf52832/sdk17.si4project/Backup/twi(6988).h
#ifndef __TWI_H
#define __TWI_H

#include "nrfx_twi.h"

#ifdef TWI_GLOBAL
#define TWI_EXT
#else
#define TWI_EXT extern 
#endif

#define SCREEN_LCD_SDA_PIN 0
#define SCREEN_LCD_SCL_PIN 1

#define SCREEN_TOUCH_SDA_PIN 2
#define SCREEN_TOUCH_SCL_PIN 3
#define MPU6050_SCL_PIN 26
#define MPU6050_SDA_PIN 27
#define MAX30102_SDA_PIN 4
#define MAX30102_SCL_PIN 5


#define SIMULATION_IIC_SCL_PIN MPU6050_SCL_PIN
#define SIMULATION_IIC_SDA_PIN MPU6050_SDA_PIN

#define GPIO_PORT_OUT (NRF_P0->OUT)
#define GPIO_PORT_DIR (NRF_P0->DIR)
#define GPIO_PORT_IN (NRF_P0->IN)

#define SDA_LOW()	  (GPIO_PORT_OUT &= ~(1<<SIMULATION_IIC_SDA_PIN))
#define SDA_HIGH() (GPIO_PORT_OUT |= (1<<SIMULATION_IIC_SDA_PIN))
#define SCL_LOW()	 (GPIO_PORT_OUT &= ~(1<<SIMULATION_IIC_SCL_PIN))
#define SCL_HIGH() (GPIO_PORT_OUT |= (1<<SIMULATION_IIC_SCL_PIN))

#define PIN_OUT_HIGH(x) GPIO_PORT_OUT_ADDR|(1<<x)
#define PIN_OUT_LOW(x)	GPIO_PORT_OUT_ADDR&(~(1<<x))

#define SDA_IN() (GPIO_PORT_DIR &= ~(1<<SIMULATION_IIC_SDA_PIN))
#define SDA_OUT()  (GPIO_PORT_DIR |= (1<<SIMULATION_IIC_SDA_PIN))

#define READ_SDA  ((GPIO_PORT_IN>>SIMULATION_IIC_SDA_PIN)&0x01)

typedef enum
{
SCREEN_LCD = 0,			
SCREEN_TOUCH,	
MPU6050,
MAX30102
}deviceName;

TWI_EXT ret_code_t TwiDriverInit(deviceName name);
TWI_EXT ret_code_t TwiDriverSend( uint8_t address, uint8_t * p_data, size_t length);
TWI_EXT void test(void);

TWI_EXT void I2cSimulationInit(void);
TWI_EXT void I2cSimulationSendByte(uint8_t data);
TWI_EXT void I2cSimulationStart(void);
TWI_EXT void I2cSimulationStop(void);
TWI_EXT bool I2cSimulationWaitAck(void);
TWI_EXT void I2cSimulationAck(void);
TWI_EXT void I2cSimulationNoAck(void);
TWI_EXT uint8_t I2cSimulationReadByte(bool ack);

#endif
